{
  "verse_id": "ACTS-10-10",
  "section_1_sacred_text": {
    "original_script": "ἐγένετο δὲ πρόσπεινος καὶ ἤθελεν γεύσασθαι· παρασκευαζόντων δὲ ⸀αὐτῶν ⸀ἐγένετο ἐπʼ αὐτὸν ἔκστασις,",
    "faithful_direct_translation": "He became but very hungry and was wishing to taste; and while they were preparing, it came upon him a trance,",
    "standalone_english_translation": "And he became hungry and wanted to eat, but while they were preparing the meal, he fell into a trance.",
    "amplified_narrative_translation": "Peter then became intensely hungry and had a strong desire to eat. But while the members of the household were in the process of preparing the food, a supernatural state of consciousness, a trance, supernaturally came over him."
  },
  "interlinear_analysis": [
    {
      "word_number": 1,
      "greek_word": "ἐγένετο",
      "transliteration": "egeneto",
      "lemma": "γίνομαι",
      "parsing_code": "V-ADI-3S",
      "parsing_expanded": "Verb, Aorist, Deponent, Indicative, 3rd person, Singular",
      "strongs_number": "G1096",
      "english_gloss": "he became",
      "contextual_meaning": "Indicates a change of state; Peter transitioned into a state of hunger. It is a key narrative verb in Luke-Acts."
    },
    {
      "word_number": 2,
      "greek_word": "δὲ",
      "transliteration": "de",
      "lemma": "δέ",
      "parsing_code": "CONJ",
      "parsing_expanded": "Conjunction",
      "strongs_number": "G1161",
      "english_gloss": "but, and",
      "contextual_meaning": "A sequential conjunction that moves the narrative forward, here translated as 'and' or 'then'."
    },
    {
      "word_number": 3,
      "greek_word": "πρόσπεινος",
      "transliteration": "prospeinos",
      "lemma": "πρόσπεινος",
      "parsing_code": "A-NMS",
      "parsing_expanded": "Adjective, Nominative, Masculine, Singular",
      "strongs_number": "G4361",
      "english_gloss": "very hungry",
      "contextual_meaning": "A compound word emphasizing intense hunger. It sets the physical stage for the spiritual vision about food."
    },
    {
      "word_number": 4,
      "greek_word": "καὶ",
      "transliteration": "kai",
      "lemma": "καί",
      "parsing_code": "CONJ",
      "parsing_expanded": "Conjunction",
      "strongs_number": "G2532",
      "english_gloss": "and",
      "contextual_meaning": "Connects Peter's state of hunger with his desire to eat."
    },
    {
      "word_number": 5,
      "greek_word": "ἤθελεν",
      "transliteration": "ēthelen",
      "lemma": "θέλω",
      "parsing_code": "V-IAI-3S",
      "parsing_expanded": "Verb, Imperfect, Active, Indicative, 3rd person, Singular",
      "strongs_number": "G2309",
      "english_gloss": "he was wanting",
      "contextual_meaning": "The imperfect tense suggests a continuous or ongoing desire. He 'kept wanting' or 'wished' to eat."
    },
    {
      "word_number": 6,
      "greek_word": "γεύσασθαι",
      "transliteration": "geusasthai",
      "lemma": "γεύομαι",
      "parsing_code": "V-AMN",
      "parsing_expanded": "Verb, Aorist, Middle, Infinitive",
      "strongs_number": "G1089",
      "english_gloss": "to taste",
      "contextual_meaning": "While literally 'to taste', this is a common idiom for 'to eat a meal'."
    },
    {
      "word_number": 7,
      "greek_word": "παρασκευαζόντων",
      "transliteration": "paraskeuazontōn",
      "lemma": "παρασκευάζω",
      "parsing_code": "V-PAP-GMP",
      "parsing_expanded": "Verb, Present, Active, Participle, Genitive, Masculine, Plural",
      "strongs_number": "G3903",
      "english_gloss": "while preparing",
      "contextual_meaning": "Part of a genitive absolute clause ('while they were preparing'), indicating the background action during which the main event (the trance) occurred."
    },
    {
      "word_number": 8,
      "greek_word": "δὲ",
      "transliteration": "de",
      "lemma": "δέ",
      "parsing_code": "CONJ",
      "parsing_expanded": "Conjunction",
      "strongs_number": "G1161",
      "english_gloss": "but, while",
      "contextual_meaning": "Here it introduces a contrast or shift: while the mundane preparations were happening, something supernatural occurred."
    },
    {
      "word_number": 9,
      "greek_word": "αὐτῶν",
      "transliteration": "autōn",
      "lemma": "αὐτός",
      "parsing_code": "P-GPM",
      "parsing_expanded": "Pronoun, Personal, Genitive, Plural, Masculine, 3rd person",
      "strongs_number": "G846",
      "english_gloss": "of them",
      "contextual_meaning": "Refers to the people in the household of Simon the tanner who were making the meal for Peter."
    },
    {
      "word_number": 10,
      "greek_word": "ἐγένετο",
      "transliteration": "egeneto",
      "lemma": "γίνομαι",
      "parsing_code": "V-ADI-3S",
      "parsing_expanded": "Verb, Aorist, Deponent, Indicative, 3rd person, Singular",
      "strongs_number": "G1096",
      "english_gloss": "it came",
      "contextual_meaning": "The second use of this verb in the verse. It signals a divine event: the trance 'came to be' or 'happened' upon him."
    },
    {
      "word_number": 11,
      "greek_word": "ἐπʼ",
      "transliteration": "ep'",
      "lemma": "ἐπί",
      "parsing_code": "PREP",
      "parsing_expanded": "Preposition",
      "strongs_number": "G1909",
      "english_gloss": "upon",
      "contextual_meaning": "Indicates that the trance was an external force that descended upon him, not something generated from within."
    },
    {
      "word_number": 12,
      "greek_word": "αὐτὸν",
      "transliteration": "auton",
      "lemma": "αὐτός",
      "parsing_code": "P-ASM",
      "parsing_expanded": "Pronoun, Personal, Accusative, Singular, Masculine, 3rd person",
      "strongs_number": "G846",
      "english_gloss": "him",
      "contextual_meaning": "Refers to Peter, the object of the spiritual experience."
    },
    {
      "word_number": 13,
      "greek_word": "ἔκστασις",
      "transliteration": "ekstasis",
      "lemma": "ἔκστασις",
      "parsing_code": "N-NFS",
      "parsing_expanded": "Noun, Nominative, Feminine, Singular",
      "strongs_number": "G1611",
      "english_gloss": "a trance",
      "contextual_meaning": "A state of being outside one's normal senses, a divinely-induced vision or trance. It is the key term describing Peter's supernatural experience."
    }
  ],
  "section_2_exegetical_synthesis": {
    "linguistic_mechanics_and_names": [
      {
        "entry": "very hungry (πρόσπεινος, prospeinos)",
        "theological_significance": "This is a rare word in the New Testament, a compound of `pros` ('in addition') and `peinao` ('to hunger'), signifying an intense, almost overwhelming hunger. The physicality of this state serves as a powerful narrative device, setting the stage for a vision that will overturn sacred Jewish dietary laws. Peter's physical craving for food is met by a spiritual vision about food, demonstrating how God engages our tangible realities to teach profound spiritual truths."
      },
      {
        "entry": "trance (ἔκστασις, ekstasis)",
        "theological_significance": "From `ek` ('out of') and `histēmi` ('to stand'), this word literally means 'a standing out of' one's normal state of mind. It is not a loss of consciousness but a state of altered consciousness where one is receptive to divine revelation. The English word 'ecstasy' is derived from it. This state signifies that the vision to come is not a dream or a product of Peter's hungry imagination, but a direct, divinely initiated experience."
      },
      {
        "entry": "Peter (Πέτρος, Petros)",
        "theological_significance": "Though not named in this verse, Peter is the subject. His name means 'rock,' given by Jesus (John 1:42). In this passage, the 'rock' of the early church, known for his stubbornness and traditionalism, is having his foundational beliefs about Jewish identity and Gentile exclusion shaken by God Himself."
      }
    ],
    "literary_devices": "The primary literary device is **juxtaposition**. Luke masterfully places the mundane, physical reality of Peter's intense hunger and the preparation of a meal right beside the sudden, supernatural event of a divine trance. This contrast heightens the impact of the revelation, showing it breaking into ordinary life unexpectedly. The use of a **genitive absolute** (`παρασκευαζόντων δὲ αὐτῶν`, 'while they were preparing') creates narrative suspense, freezing the background action to focus the reader on the pivotal spiritual event about to unfold. The **repetition** of `ἐγένετο (egeneto)` first for Peter's hunger ('he became') and second for the trance ('it came') poetically links his physical state to the divine intervention.",
    "aggregate_analogia_scriptura": "The concept of a divine `ἔκστασις (ekstasis)` or trance is seen elsewhere in Scripture, confirming it as a valid mode of divine revelation. In Acts 22:17, Paul describes falling into a trance while praying in the temple. The experience is similar to the 'deep sleep' (`tardemah`) that fell upon Abram in Genesis 15:12 before God established His covenant, and the state of Balaam, who saw visions of God 'with eyes uncovered' (Numbers 24:4). This verse's theme of physical hunger preceding a spiritual mandate echoes Jesus' temptation in the wilderness after 40 days of fasting (Matthew 4:1-11). In both cases, a physical state of want precedes a moment of profound spiritual significance. Most importantly, the vision Peter receives is the New Covenant application of Jesus's declaration in Mark 7:19 that he 'declared all foods clean,' a truth the apostles were still struggling to grasp in its full implication for Jew-Gentile relations.",
    "literal_primary_filter": [
      "Peter experienced a state of intense, physical hunger.",
      "He strongly desired to eat a meal.",
      "While others in the house were in the process of preparing food, an event occurred.",
      "This event was a supernatural 'trance' that came 'upon him,' indicating it was an external spiritual experience, not an internal psychological one."
    ],
    "prophetic_typology_and_intertextuality": {
      "type_shadow": "The Levitical dietary laws (Leviticus 11, Deuteronomy 14) which distinguished between clean and unclean animals were a 'type' or 'shadow'. They served a practical purpose but also a typological one: to physically represent the spiritual separation between Israel, God's 'clean' and chosen people, and the 'unclean' Gentile nations.",
      "antitype_fulfillment": "The 'antitype' or fulfillment is the reality in Christ, unveiled in Peter's vision. Through His atoning sacrifice, Christ has cleansed what was formerly unclean. This applies not just to food, but decisively to people. The wall of hostility between Jew and Gentile is broken down (Ephesians 2:14), making one new man in Christ. Peter's vision is the apostolic key that unlocks the door for the Gospel to go intentionally and officially to the Gentiles.",
      "progression_notes": "This verse marks a critical juncture in redemptive history. It is the catalyst for the 'Gentile Pentecost' in Cornelius's house (Acts 10:44-48). It moves the church beyond its Jerusalem-centric, Jewish-dominated origins and sets the stage for the Pauline mission, thus fulfilling the promise of the Abrahamic Covenant that in him 'all the families of the earth shall be blessed' (Genesis 12:3)."
    },
    "numerical_and_gematria_significance": "There is no significant numerical or gematrical symbolism in this verse. The focus is on the narrative and theological development.",
    "historical_context_and_chronology": {
      "dates": "This event is dated to approximately 40-41 AD. This places it during the turbulent reign of Roman Emperor Caligula (37-41 AD) or just at the beginning of Claudius's reign (41-54 AD). It occurs several years after the stoning of Stephen and the conversion of Saul, but before the Jerusalem Council of Acts 15.",
      "context": "The early church was still navigating its identity relative to Judaism. While Hellenistic Jews and proselytes were part of the church, the direct, intentional evangelization of uncircumcised, pagan-background Gentiles was a major, controversial step. This divinely-orchestrated encounter between Peter and Cornelius was necessary to give apostolic sanction to the Gentile mission."
    },
    "socio_political_matrix": "Peter was staying with 'Simon, a tanner' (Acts 9:43). Tanning was a ritually unclean profession for Jews due to the handling of dead animals and carcasses. Peter's willingness to lodge there already suggests a relaxation of his traditional purity standards, preparing his heart for the larger revelation to come. The rigid social and religious barrier between Jews and Gentiles in the Roman Empire was profound. Pious Jews would not enter a Gentile home or eat with a Gentile for fear of ritual defilement. This social barrier, more than Roman law, kept the communities separate. Peter's vision and subsequent actions directly challenge this deeply ingrained socio-religious structure.",
    "geospatial_and_physical_geography": {
      "modern_location": "Joppa (modern Jaffa, which is part of the Tel Aviv-Yafo municipality in Israel).",
      "coordinates": {
        "lat": 32.0537,
        "long": 34.7505
      },
      "altitude_m": 15,
      "terrain_climate_characteristics": "Joppa is an ancient port city on the Mediterranean coast. The terrain is a flat coastal plain. The climate is Mediterranean, with hot, sunny days. Peter was on a flat rooftop (Acts 10:9), a common feature of homes in the region, used for work, rest, and prayer, especially to catch the sea breeze during the heat of midday (the 'sixth hour')."
    },
    "archaeological_confirmation": "Excavations in Jaffa have unearthed extensive remains from various periods, including the Roman era, confirming it as a major, continuously inhabited port city. The discovery of Roman-period dwellings with evidence of flat roofs and external staircases aligns perfectly with the architectural setting described in Acts. While Simon the tanner's specific house is not identifiable, the general environment described by Luke is fully consistent with the archaeological record of first-century Joppa."
  },
  "geographic_calculations": [
    {
      "from_location": "Caesarea Maritima",
      "to_location": "Joppa",
      "straight_line_distance_km": 56,
      "ancient_route_distance_km": 65,
      "elevation_change_m": -10,
      "estimated_travel_time_days": {
        "on_foot": 2.2,
        "by_donkey": 1.8,
        "by_horse": 1.2
      },
      "uncertainty_notes": "This calculation is for the journey of Cornelius's men to Peter (Acts 10:7-8). The route would have followed the well-established Roman coastal road, the Via Maris. The travel time of just over a day ('they arrived the following day') mentioned in Acts 10:24 refers to Peter's return journey with them, which aligns with these estimates."
    }
  ],
  "tags": {
    "tier_1_foundational_theology": {
      "holy_spirit": [
        "divine revelation",
        "visions and trances"
      ],
      "gospel": [
        "universal scope of the gospel",
        "Gentile inclusion"
      ],
      "soteriology": [
        "breaking down barriers to salvation"
      ],
      "covenant_theology": [
        "transition from Old Covenant restrictions to New Covenant freedom"
      ]
    },
    "tier_2_applied_theology": {
      "prayer": [
        "revelation received in a context of prayer"
      ],
      "faith": [
        "readiness to receive new divine instruction"
      ],
      "witness_evangelism": [
        "preparation for cross-cultural ministry"
      ],
      "discipleship": [
        "challenging pre-conceived notions"
      ]
    },
    "tier_3_relational_ethics": {
      "church_community": [
        "breaking down ethnic and social walls"
      ],
      "compassion_mercy": [
        "God's mercy extending beyond Israel"
      ],
      "truthfulness": [
        "confronting religious prejudice with divine truth"
      ]
    },
    "tier_4_cultural_historical": {
      "jewish_customs": [
        "dietary laws",
        "ritual purity",
        "housetop prayer"
      ],
      "gentiles": [
        "Cornelius narrative",
        "God-fearers"
      ],
      "travel_trade_routes": [
        "Via Maris",
        "Caesarea to Joppa"
      ]
    },
    "tier_5_literary_prophetic": {
      "narrative_history": [
        "pivotal moment in the book of Acts"
      ],
      "symbolism": [
        "hunger as spiritual readiness",
        "food as a symbol for people"
      ],
      "prophecy_fulfillment": [
        "blessing of Abraham to all nations"
      ]
    }
  },
  "section_3_life_application": "Acts 10:10 teaches us that God often breaks into the ordinary routines of our lives to do extraordinary things. Peter's profound spiritual vision came not in a grand cathedral, but on a simple rooftop while he was hungry and waiting for lunch. This encourages us to be spiritually attentive in all circumstances, recognizing that God can use our physical needs and daily activities as a backdrop for divine revelation. Furthermore, Peter's experience is a powerful call to examine our own hearts for hidden prejudices and traditions that may contradict the radical inclusivity of the Gospel. Just as Peter's long-held beliefs about 'clean' and 'unclean' were about to be overturned, we must be willing to allow the Holy Spirit to challenge our cultural and personal biases, so that we can fully embrace God's mission for all people."
}