{
  "verse_id": "ACTS-10-14",
  "section_1_sacred_text": {
    "verse_reference": "Acts 10:14",
    "original_script": "ὁ δὲ Πέτρος εἶπεν· Μηδαμῶς, κύριε, ὅτι οὐδέποτε ἔφαγον πᾶν κοινὸν ⸀καὶ ἀκάθαρτον.",
    "faithful_direct_translation": "But Peter said: By no means, Lord, because never have I eaten anything common and unclean.",
    "standalone_english_translation": "But Peter said, 'By no means, Lord; for I have never eaten anything that is common or unclean.'",
    "amplified_narrative_translation": "But Peter, in a moment of visceral and devout protest, declared, 'Absolutely not, my Lord, because not once in my entire lifetime have I ever consumed anything that is ceremonially profane or ritually impure.'"
  },
  "section_2_exegetical_synthesis": "The statement of Peter is a literal, historical exclamation of shock, revealing the profound depth of his lifelong adherence to the Mosaic Law.\nHis response is not rebellion, but a reflex of piety conditioned by years of obedience to God's revealed will in the Torah.\nThis verse serves as the critical turning point in a narrative designed to dismantle one of the primary barriers between Jews and Gentiles in the early Church.\n\nThe thematic cognate for this event is the system of dietary laws (kashrut) established in the Pentateuch, primarily in Leviticus 11 and Deuteronomy 14.\nThese laws were the 'Type' or shadow, a physical and daily reminder that set Israel apart as a holy nation, distinct from the surrounding Gentile peoples (Leviticus 20:25-26).\nThe physical separation created by food laws was a tangible representation of the spiritual separation between a holy God and a sinful world, and between His covenant people and the nations.\nThe 'Antitype' or fulfillment is the work of Jesus Christ, who breaks down the 'dividing wall of hostility' between Jew and Gentile (Ephesians 2:14).\nChrist's declaration that all foods are clean (Mark 7:19) is the theological foundation for this vision, though its full implication is only now being revealed to Peter.\nThe vision's ultimate purpose is to show that God has cleansed the Gentiles through faith in Christ, making them acceptable, thus annulling the ceremonial laws that symbolized their separation.\nPeter's visceral rejection mirrors that of the prophet Ezekiel when commanded to eat defiled bread in a prophetic sign-act, crying out, 'Ah, Lord GOD! Behold, I have never been defiled' (Ezekiel 4:14), showing a consistent pattern of pious horror at the thought of violating God's commands for holiness.\n\nThe name Πέτρος (Petros, 'Rock' or 'Stone') is significant; the apostle who was the 'rock' of the early Jewish church is here shown resisting the foundational revelation that will build the universal Church of both Jew and Gentile.\nHis exclamation begins with Μηδαμῶς (mēdamōs, 'By no means!'), the strongest possible Greek negative, conveying horrified refusal.\nHe addresses the divine voice as κύριε (kyrie, 'Lord'), creating an immediate tension: he acknowledges the authority of the speaker while simultaneously refusing the command.\nThis paradox highlights the immense internal conflict between his past training and this new directive.\nHe justifies his refusal with the emphatic adverb οὐδέποτε (oudepote, 'never at any time'), stressing an unbroken lifetime of faithfulness.\nThe two adjectives used are critical: κοινὸν (koinon, 'common' or 'profane') refers to what is not set apart for holy use, while ἀκάθαρτον (akatharton, 'unclean') refers to what is intrinsically impure by the Law's definition. Together, they form a comprehensive declaration of his observance.\n\nThe primary literary device is dramatic dialogue, which externalizes Peter's internal struggle and highlights the radical nature of God's command.\nThe vision itself is a form of divine parable, using the imagery of unclean animals to teach a profound truth about people.\nThe threefold repetition of the vision and command (Acts 10:16) serves as a divine emphasis, confirming the validity and importance of this new revelation.\nThe number three in Scripture frequently denotes divine confirmation, completeness, and binding authority, serving to overcome Peter's deep-seated cultural and religious objections.\n\nThis event is conservatively dated to A.D. 40-41.\nThis places it roughly a decade after Pentecost and prior to the major persecution under Herod Agrippa I (A.D. 44), a crucial transitional period for the early Church as it began to look beyond its Jewish origins.\nThe historical context is one of rigid social and religious segregation between Jews and Gentiles, where sharing a meal or entering a Gentile's home was considered a source of defilement for a devout Jew (Acts 10:28; Galatians 2:12).\n\nThe socio-political matrix is defined by Roman occupation. The narrative's other main character, Cornelius, is a centurion of the Italian Cohort stationed in Caesarea Maritima, the Roman administrative capital of Judea. He represents the might and order of the occupying power.\nFor Peter, a Galilean fisherman, to be commanded to go to the home of a Roman military officer was not just a religious problem but a crossing of immense social and political boundaries.\n\nThis vision takes place in the ancient port city of Joppa (modern Jaffa, a district of Tel Aviv-Yafo, Israel), located at approximately 32.05° N, 34.75° E, at an altitude near sea level.\nThe vision occurs on the flat roof of the house of 'Simon, a tanner' (Acts 10:6).\nThe physical geography is significant: Joppa is on the coast of the Mediterranean, the 'Great Sea' which often symbolized the Gentile nations in Hebrew thought. Peter is literally on the boundary between the Holy Land and the Gentile world.\nThe trade of a tanner was considered ceremonially unclean because it involved handling dead carcasses and odorous chemicals, meaning Simon's house would have been located by the sea, on the periphery of the town. This 'unclean' setting provides a fitting backdrop for God's message that He is cleansing the unclean.\n\nArchaeologically, extensive work in Jaffa has confirmed its status as a major port in the Roman era. While the specific house of Simon the tanner is unknown, the existence of Roman-era houses with flat, accessible rooftops for work and prayer is well-attested throughout the region. Remains of Roman-era tanneries found elsewhere in the empire confirm the nature and typical location of this trade, lending verisimilitude to the biblical account.\n\nIn aggregate, Peter's sincere but mistaken protest in Acts 10:14 is the voice of the Old Covenant order being confronted by the radical inclusivity of the New Covenant. The 'Plain Meaning' is that Peter was horrified by a command to violate dietary laws he had kept his entire life. The *Analogia Scriptura* reveals that God used this command about food to teach a greater lesson about people. What God has cleansed through the blood of Christ—the Gentiles—Peter must no longer consider 'common or unclean' (Acts 10:15). This moment is the divinely orchestrated pivot that validates the Gentile mission, prepares Peter to meet Cornelius, and equips him to defend this revolutionary action before the Jerusalem Council (Acts 11), thereby opening the Gospel to the entire world.",
  "section_3_life_application": "Our sincerest devotion and long-held traditions, while often good, can sometimes become barriers to what God wants to do next. We must examine our own hearts for any 'By no means, Lord' responses to His leading, especially when He calls us to cross cultural, social, or personal boundaries we have erected.\n\nGod is fundamentally concerned with people. The rules of separation in the Old Testament were meant to point to a greater holiness that is now found in Christ. Our application, therefore, is not to create new rules of separation, but to actively dismantle the unbiblical walls of prejudice, preference, and fear that keep us from sharing the Gospel with those we might consider 'unclean' or 'other'.\n\nIdentify a person or group of people that your background, culture, or comfort zone has taught you to avoid. Pray for God to give you His heart for them, just as He did for Peter. Then, take one practical step this week to cross that boundary—initiate a conversation, share a meal, or offer a kindness—as a direct act of obedience to the God who cleanses all who come to Him through Christ."
}